; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v13 ?v2)
             (pred_2 ?v7 ?v8)
             (pred_6 ?v13 ?v8)
             (pred_5 ?v3 ?v13 )
	     (pred_11 ?v13)
             (pred_4 ?v12)
             (pred_10 ?v7)
             (pred_9 ?v8)
             (pred_7 ?v13)
             (pred_1 ?v7)
             (pred_12 ?v13)
             (pred_3 ))



(:action op_3
:parameters (?v6 ?v9 ?v11 ?v1)
:precondition (and (pred_4 ?v6) (pred_4 ?v9) (pred_10 ?v11) (pred_9 ?v1)
          (pred_8 ?v6 ?v9) (pred_2 ?v11 ?v1)
                   (pred_6 ?v9 ?v1) (pred_11 ?v6) 
                   (pred_7 ?v9) (pred_1 ?v11))
:effect (and  (pred_12 ?v9) (not (pred_7 ?v9))))


(:action op_5
:parameters (?v6 ?v4)
:precondition (and (pred_4 ?v6) (pred_4 ?v4)
               (pred_11 ?v6) (pred_8 ?v6 ?v4) (pred_12 ?v4))
:effect (and (pred_11 ?v4) (not (pred_11 ?v6))))

(:action op_1
:parameters (?v6 ?v11)
:precondition (and (pred_4 ?v6) (pred_10 ?v11) 
                  (pred_11 ?v6) (pred_5 ?v11 ?v6) (pred_3 ))
:effect (and (pred_1 ?v11)
   (not (pred_5 ?v11 ?v6)) (not (pred_3 ))))


(:action op_4
:parameters (?v6 ?v10 ?v5)
:precondition (and (pred_4 ?v6) (pred_10 ?v10) (pred_10 ?v5)
                  (pred_11 ?v6) (pred_1 ?v5) (pred_5 ?v10 ?v6))
:effect (and (pred_1 ?v10) (pred_5 ?v5 ?v6)
        (not (pred_1 ?v5)) (not (pred_5 ?v10 ?v6))))

(:action op_2
:parameters (?v6 ?v11)
:precondition (and (pred_4 ?v6) (pred_10 ?v11) 
                  (pred_11 ?v6) (pred_1 ?v11))
:effect (and (pred_3 ) (pred_5 ?v11 ?v6) (not (pred_1 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_08 obj_03 obj_11 obj_05 obj_13 obj_12 obj_10 obj_02 obj_06
    obj_09 obj_01
    obj_04 obj_07
    )

    (:init
       (pred_3)

       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_11)
       (pred_4 obj_05)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_02)
       (pred_4 obj_06)
       (pred_9 obj_09)
       (pred_9 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_07)

       (pred_8 obj_08 obj_05)
       (pred_8 obj_08 obj_03)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_08)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_08)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_12 obj_06)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_06 obj_12)
       (pred_8 obj_06 obj_02)
       (pred_7 obj_02)
       (pred_7 obj_06)
       (pred_6  obj_02 obj_09)
       (pred_6  obj_06 obj_01)
       (pred_12 obj_08)
       (pred_12 obj_03)
       (pred_12 obj_11)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_10)

       (pred_2  obj_04 obj_09)
       (pred_2  obj_07 obj_01)
       (pred_5 obj_04 obj_06)
       (pred_5 obj_07 obj_10)
       (pred_11 obj_11)
    )

    (:goal (and
       (pred_5 obj_07 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_13)))
)
)

; plan
1. (op_5 obj_11 obj_03)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_03)
   goals met: 0 of 1
2. (op_5 obj_03 obj_08)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_05)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_05)
   goals met: 0 of 1
4. (op_5 obj_05 obj_10)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_10)
   goals met: 0 of 1
5. (op_1 obj_10 obj_07)
   deleted: (pred_5 obj_07 obj_10) (pred_3)
   added: (pred_1 obj_07)
   goals met: 0 of 1
6. (op_5 obj_10 obj_05)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_05)
   goals met: 0 of 1
7. (op_5 obj_05 obj_08)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_08)
   goals met: 0 of 1
8. (op_5 obj_08 obj_03)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_03)
   goals met: 0 of 1
9. (op_5 obj_03 obj_11)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_11)
   goals met: 0 of 1
10. (op_5 obj_11 obj_12)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_12)
   goals met: 0 of 1
11. (op_3 obj_12 obj_06 obj_07 obj_01)
   deleted: (pred_7 obj_06)
   added: (pred_12 obj_06)
   goals met: 0 of 1
12. (op_5 obj_12 obj_06)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_06)
   goals met: 0 of 1
13. (op_4 obj_06 obj_04 obj_07)
   deleted: (pred_1 obj_07) (pred_5 obj_04 obj_06)
   added: (pred_1 obj_04) (pred_5 obj_07 obj_06)
   goals met: 1 of 1
